Revit 2027 API
TableSectionData.CanInsertColumn Method
 Verifies if a new column can be inserted at the given index.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanInsertColumn(
	int nIndex
)
Public Function CanInsertColumn (
	nIndex As Integer
) As Boolean
public:
bool CanInsertColumn(
	int nIndex
)
member CanInsertColumn :
        nIndex : int -> bool
Parameters
nIndex Int32
 An integer index.
Return Value
Boolean
 True if the column can be inserted, false otherwise.
See Also
Reference
TableSectionData Class
Autodesk.Revit.DB Namespace